load-test/result-nodeport-1replica.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/hancrystal/Downloads/GongGuHaSong-main/load-test/scaleout-compare-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 4m30s max duration (incl. graceful stop):
              * ramp_up: Up to 300 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-27T03:20:28+09:00" level=info msg="=== 스케일 아웃 비교 테스트 (replicas=1) ===" source=console
time="2026-03-27T03:20:28+09:00" level=info msg="비교 지표: 처리량(RPS), 응답시간(p50/p95/p99), 성공률, 정합성" source=console
time="2026-03-27T03:20:28+09:00" level=info msg="======================================================" source=console

Run       [ 100% ] setup()
ramp_up   [   0% ]

Run       [ 100% ] setup()
ramp_up   [   0% ]

Run       [ 100% ] setup()
ramp_up   [   0% ]
time="2026-03-27T03:20:31+09:00" level=info msg="포인트 초기화 완료: 500명 x 50,000P" source=console

running (0m04.0s), 001/300 VUs, 0 complete and 0 interrupted iterations
ramp_up   [   0% ] 001/300 VUs  0m00.6s/4m00.0s

running (0m05.0s), 002/300 VUs, 18 complete and 0 interrupted iterations
ramp_up   [   1% ] 002/300 VUs  0m01.6s/4m00.0s

running (0m06.0s), 004/300 VUs, 60 complete and 0 interrupted iterations
ramp_up   [   1% ] 004/300 VUs  0m02.6s/4m00.0s

running (0m07.0s), 006/300 VUs, 120 complete and 0 interrupted iterations
ramp_up   [   2% ] 006/300 VUs  0m03.6s/4m00.0s

running (0m08.0s), 007/300 VUs, 197 complete and 0 interrupted iterations
ramp_up   [   2% ] 007/300 VUs  0m04.6s/4m00.0s

running (0m09.0s), 009/300 VUs, 291 complete and 0 interrupted iterations
ramp_up   [   2% ] 009/300 VUs  0m05.6s/4m00.0s

running (0m10.0s), 011/300 VUs, 403 complete and 0 interrupted iterations
ramp_up   [   3% ] 011/300 VUs  0m06.6s/4m00.0s

running (0m11.0s), 012/300 VUs, 477 complete and 0 interrupted iterations
ramp_up   [   3% ] 012/300 VUs  0m07.6s/4m00.0s

running (0m12.0s), 014/300 VUs, 612 complete and 0 interrupted iterations
ramp_up   [   4% ] 014/300 VUs  0m08.6s/4m00.0s

running (0m13.0s), 016/300 VUs, 729 complete and 0 interrupted iterations
ramp_up   [   4% ] 016/300 VUs  0m09.6s/4m00.0s

running (0m14.0s), 017/300 VUs, 791 complete and 0 interrupted iterations
ramp_up   [   4% ] 017/300 VUs  0m10.6s/4m00.0s

running (0m15.0s), 019/300 VUs, 893 complete and 0 interrupted iterations
ramp_up   [   5% ] 019/300 VUs  0m11.6s/4m00.0s

running (0m16.0s), 021/300 VUs, 1008 complete and 0 interrupted iterations
ramp_up   [   5% ] 021/300 VUs  0m12.6s/4m00.0s

running (0m17.0s), 022/300 VUs, 1154 complete and 0 interrupted iterations
ramp_up   [   6% ] 022/300 VUs  0m13.6s/4m00.0s

running (0m18.0s), 024/300 VUs, 1234 complete and 0 interrupted iterations
ramp_up   [   6% ] 024/300 VUs  0m14.6s/4m00.0s

running (0m19.0s), 026/300 VUs, 1418 complete and 0 interrupted iterations
ramp_up   [   7% ] 026/300 VUs  0m15.6s/4m00.0s

running (0m20.0s), 027/300 VUs, 1575 complete and 0 interrupted iterations
ramp_up   [   7% ] 027/300 VUs  0m16.6s/4m00.0s

running (0m21.0s), 029/300 VUs, 1673 complete and 0 interrupted iterations
ramp_up   [   7% ] 029/300 VUs  0m17.6s/4m00.0s

running (0m22.0s), 031/300 VUs, 1834 complete and 0 interrupted iterations
ramp_up   [   8% ] 031/300 VUs  0m18.6s/4m00.0s

running (0m23.0s), 032/300 VUs, 1991 complete and 0 interrupted iterations
ramp_up   [   8% ] 032/300 VUs  0m19.6s/4m00.0s

running (0m24.0s), 034/300 VUs, 2140 complete and 0 interrupted iterations
ramp_up   [   9% ] 034/300 VUs  0m20.6s/4m00.0s

running (0m25.0s), 036/300 VUs, 2293 complete and 0 interrupted iterations
ramp_up   [   9% ] 036/300 VUs  0m21.6s/4m00.0s

running (0m26.0s), 037/300 VUs, 2516 complete and 0 interrupted iterations
ramp_up   [   9% ] 037/300 VUs  0m22.6s/4m00.0s

running (0m27.0s), 039/300 VUs, 2665 complete and 0 interrupted iterations
ramp_up   [  10% ] 039/300 VUs  0m23.6s/4m00.0s

running (0m28.0s), 041/300 VUs, 2774 complete and 0 interrupted iterations
ramp_up   [  10% ] 041/300 VUs  0m24.6s/4m00.0s

running (0m29.0s), 042/300 VUs, 2947 complete and 0 interrupted iterations
ramp_up   [  11% ] 042/300 VUs  0m25.6s/4m00.0s

running (0m30.0s), 044/300 VUs, 3146 complete and 0 interrupted iterations
ramp_up   [  11% ] 044/300 VUs  0m26.6s/4m00.0s

running (0m31.0s), 046/300 VUs, 3246 complete and 0 interrupted iterations
ramp_up   [  12% ] 046/300 VUs  0m27.6s/4m00.0s

running (0m32.0s), 047/300 VUs, 3347 complete and 0 interrupted iterations
ramp_up   [  12% ] 047/300 VUs  0m28.6s/4m00.0s

running (0m33.0s), 049/300 VUs, 3512 complete and 0 interrupted iterations
ramp_up   [  12% ] 049/300 VUs  0m29.6s/4m00.0s

running (0m34.0s), 050/300 VUs, 3642 complete and 0 interrupted iterations
ramp_up   [  13% ] 050/300 VUs  0m30.6s/4m00.0s

running (0m35.0s), 051/300 VUs, 3783 complete and 0 interrupted iterations
ramp_up   [  13% ] 051/300 VUs  0m31.6s/4m00.0s

running (0m36.0s), 052/300 VUs, 3890 complete and 0 interrupted iterations
ramp_up   [  14% ] 052/300 VUs  0m32.6s/4m00.0s

running (0m37.0s), 053/300 VUs, 3964 complete and 0 interrupted iterations
ramp_up   [  14% ] 053/300 VUs  0m33.6s/4m00.0s

running (0m38.0s), 053/300 VUs, 4057 complete and 0 interrupted iterations
ramp_up   [  14% ] 053/300 VUs  0m34.6s/4m00.0s

running (0m39.0s), 054/300 VUs, 4237 complete and 0 interrupted iterations
ramp_up   [  15% ] 054/300 VUs  0m35.6s/4m00.0s

running (0m40.0s), 055/300 VUs, 4419 complete and 0 interrupted iterations
ramp_up   [  15% ] 055/300 VUs  0m36.6s/4m00.0s

running (0m41.0s), 056/300 VUs, 4586 complete and 0 interrupted iterations
ramp_up   [  16% ] 056/300 VUs  0m37.6s/4m00.0s

running (0m42.0s), 057/300 VUs, 4786 complete and 0 interrupted iterations
ramp_up   [  16% ] 057/300 VUs  0m38.6s/4m00.0s

running (0m43.0s), 058/300 VUs, 5039 complete and 0 interrupted iterations
ramp_up   [  17% ] 058/300 VUs  0m39.6s/4m00.0s

running (0m44.0s), 058/300 VUs, 5317 complete and 0 interrupted iterations
ramp_up   [  17% ] 058/300 VUs  0m40.6s/4m00.0s

running (0m45.0s), 059/300 VUs, 5479 complete and 0 interrupted iterations
ramp_up   [  17% ] 059/300 VUs  0m41.6s/4m00.0s

running (0m46.0s), 060/300 VUs, 5688 complete and 0 interrupted iterations
ramp_up   [  18% ] 060/300 VUs  0m42.6s/4m00.0s

running (0m47.0s), 061/300 VUs, 5908 complete and 0 interrupted iterations
ramp_up   [  18% ] 061/300 VUs  0m43.6s/4m00.0s

running (0m48.0s), 062/300 VUs, 6059 complete and 0 interrupted iterations
ramp_up   [  19% ] 062/300 VUs  0m44.6s/4m00.0s

running (0m49.0s), 063/300 VUs, 6292 complete and 0 interrupted iterations
ramp_up   [  19% ] 063/300 VUs  0m45.6s/4m00.0s

running (0m50.0s), 063/300 VUs, 6609 complete and 0 interrupted iterations
ramp_up   [  19% ] 063/300 VUs  0m46.6s/4m00.0s

running (0m51.0s), 064/300 VUs, 6836 complete and 0 interrupted iterations
ramp_up   [  20% ] 064/300 VUs  0m47.6s/4m00.0s

running (0m52.0s), 065/300 VUs, 7114 complete and 0 interrupted iterations
ramp_up   [  20% ] 065/300 VUs  0m48.6s/4m00.0s

running (0m53.0s), 066/300 VUs, 7269 complete and 0 interrupted iterations
ramp_up   [  21% ] 066/300 VUs  0m49.6s/4m00.0s

running (0m54.0s), 067/300 VUs, 7522 complete and 0 interrupted iterations
ramp_up   [  21% ] 067/300 VUs  0m50.6s/4m00.0s

running (0m55.0s), 068/300 VUs, 7829 complete and 0 interrupted iterations
ramp_up   [  22% ] 068/300 VUs  0m51.6s/4m00.0s

running (0m56.0s), 068/300 VUs, 8051 complete and 0 interrupted iterations
ramp_up   [  22% ] 068/300 VUs  0m52.6s/4m00.0s

running (0m57.0s), 069/300 VUs, 8292 complete and 0 interrupted iterations
ramp_up   [  22% ] 069/300 VUs  0m53.6s/4m00.0s

running (0m58.0s), 070/300 VUs, 8425 complete and 0 interrupted iterations
ramp_up   [  23% ] 070/300 VUs  0m54.6s/4m00.0s

running (0m59.0s), 071/300 VUs, 8655 complete and 0 interrupted iterations
ramp_up   [  23% ] 071/300 VUs  0m55.6s/4m00.0s

running (1m00.0s), 072/300 VUs, 8921 complete and 0 interrupted iterations
ramp_up   [  24% ] 072/300 VUs  0m56.6s/4m00.0s

running (1m01.0s), 073/300 VUs, 9107 complete and 0 interrupted iterations
ramp_up   [  24% ] 073/300 VUs  0m57.6s/4m00.0s

running (1m02.0s), 073/300 VUs, 9288 complete and 0 interrupted iterations
ramp_up   [  24% ] 073/300 VUs  0m58.6s/4m00.0s

running (1m03.0s), 074/300 VUs, 9565 complete and 0 interrupted iterations
ramp_up   [  25% ] 074/300 VUs  0m59.6s/4m00.0s

running (1m04.0s), 075/300 VUs, 9768 complete and 0 interrupted iterations
ramp_up   [  25% ] 075/300 VUs  1m00.6s/4m00.0s

running (1m05.0s), 076/300 VUs, 9959 complete and 0 interrupted iterations
ramp_up   [  26% ] 076/300 VUs  1m01.6s/4m00.0s

running (1m06.0s), 077/300 VUs, 10190 complete and 0 interrupted iterations
ramp_up   [  26% ] 077/300 VUs  1m02.6s/4m00.0s

running (1m07.0s), 078/300 VUs, 10491 complete and 0 interrupted iterations
ramp_up   [  27% ] 078/300 VUs  1m03.6s/4m00.0s

running (1m08.0s), 078/300 VUs, 10684 complete and 0 interrupted iterations
ramp_up   [  27% ] 078/300 VUs  1m04.6s/4m00.0s

running (1m09.0s), 079/300 VUs, 10933 complete and 0 interrupted iterations
ramp_up   [  27% ] 079/300 VUs  1m05.6s/4m00.0s

running (1m10.0s), 080/300 VUs, 11165 complete and 0 interrupted iterations
ramp_up   [  28% ] 080/300 VUs  1m06.6s/4m00.0s

running (1m11.0s), 081/300 VUs, 11390 complete and 0 interrupted iterations
ramp_up   [  28% ] 081/300 VUs  1m07.6s/4m00.0s

running (1m12.0s), 082/300 VUs, 11631 complete and 0 interrupted iterations
ramp_up   [  29% ] 082/300 VUs  1m08.6s/4m00.0s

running (1m13.0s), 083/300 VUs, 11906 complete and 0 interrupted iterations
ramp_up   [  29% ] 083/300 VUs  1m09.6s/4m00.0s

running (1m14.0s), 083/300 VUs, 12237 complete and 0 interrupted iterations
ramp_up   [  29% ] 083/300 VUs  1m10.6s/4m00.0s

running (1m15.0s), 084/300 VUs, 12541 complete and 0 interrupted iterations
ramp_up   [  30% ] 084/300 VUs  1m11.6s/4m00.0s

running (1m16.0s), 085/300 VUs, 12623 complete and 0 interrupted iterations
ramp_up   [  30% ] 085/300 VUs  1m12.6s/4m00.0s

running (1m17.0s), 086/300 VUs, 12892 complete and 0 interrupted iterations
ramp_up   [  31% ] 086/300 VUs  1m13.6s/4m00.0s

running (1m18.0s), 087/300 VUs, 13052 complete and 0 interrupted iterations
ramp_up   [  31% ] 087/300 VUs  1m14.6s/4m00.0s

running (1m19.0s), 088/300 VUs, 13293 complete and 0 interrupted iterations
ramp_up   [  32% ] 088/300 VUs  1m15.6s/4m00.0s

running (1m20.0s), 088/300 VUs, 13591 complete and 0 interrupted iterations
ramp_up   [  32% ] 088/300 VUs  1m16.6s/4m00.0s

running (1m21.0s), 089/300 VUs, 13775 complete and 0 interrupted iterations
ramp_up   [  32% ] 089/300 VUs  1m17.6s/4m00.0s

running (1m22.0s), 090/300 VUs, 14032 complete and 0 interrupted iterations
ramp_up   [  33% ] 090/300 VUs  1m18.6s/4m00.0s

running (1m23.0s), 091/300 VUs, 14261 complete and 0 interrupted iterations
ramp_up   [  33% ] 091/300 VUs  1m19.6s/4m00.0s

running (1m24.0s), 092/300 VUs, 14596 complete and 0 interrupted iterations
ramp_up   [  34% ] 092/300 VUs  1m20.6s/4m00.0s

running (1m25.0s), 093/300 VUs, 14900 complete and 0 interrupted iterations
ramp_up   [  34% ] 093/300 VUs  1m21.6s/4m00.0s

running (1m26.0s), 093/300 VUs, 15200 complete and 0 interrupted iterations
ramp_up   [  34% ] 093/300 VUs  1m22.6s/4m00.0s

running (1m27.0s), 094/300 VUs, 15395 complete and 0 interrupted iterations
ramp_up   [  35% ] 094/300 VUs  1m23.6s/4m00.0s

running (1m28.0s), 095/300 VUs, 15563 complete and 0 interrupted iterations
ramp_up   [  35% ] 095/300 VUs  1m24.6s/4m00.0s

running (1m29.0s), 096/300 VUs, 15820 complete and 0 interrupted iterations
ramp_up   [  36% ] 096/300 VUs  1m25.6s/4m00.0s

running (1m30.0s), 097/300 VUs, 16026 complete and 0 interrupted iterations
ramp_up   [  36% ] 097/300 VUs  1m26.7s/4m00.0s

running (1m31.0s), 098/300 VUs, 16239 complete and 0 interrupted iterations
ramp_up   [  37% ] 098/300 VUs  1m27.6s/4m00.0s

running (1m32.0s), 098/300 VUs, 16395 complete and 0 interrupted iterations
ramp_up   [  37% ] 098/300 VUs  1m28.6s/4m00.0s

running (1m33.0s), 099/300 VUs, 16637 complete and 0 interrupted iterations
ramp_up   [  37% ] 099/300 VUs  1m29.6s/4m00.0s

running (1m34.0s), 101/300 VUs, 16859 complete and 0 interrupted iterations
ramp_up   [  38% ] 101/300 VUs  1m30.6s/4m00.0s

running (1m35.0s), 102/300 VUs, 17040 complete and 0 interrupted iterations
ramp_up   [  38% ] 102/300 VUs  1m31.6s/4m00.0s

running (1m36.0s), 104/300 VUs, 17238 complete and 0 interrupted iterations
ramp_up   [  39% ] 104/300 VUs  1m32.6s/4m00.0s

running (1m37.0s), 106/300 VUs, 17486 complete and 0 interrupted iterations
ramp_up   [  39% ] 106/300 VUs  1m33.6s/4m00.0s

running (1m38.0s), 107/300 VUs, 17683 complete and 0 interrupted iterations
ramp_up   [  39% ] 107/300 VUs  1m34.6s/4m00.0s

running (1m39.0s), 109/300 VUs, 17987 complete and 0 interrupted iterations
ramp_up   [  40% ] 109/300 VUs  1m35.6s/4m00.0s

running (1m40.0s), 111/300 VUs, 18184 complete and 0 interrupted iterations
ramp_up   [  40% ] 111/300 VUs  1m36.6s/4m00.0s

running (1m41.0s), 112/300 VUs, 18390 complete and 0 interrupted iterations
ramp_up   [  41% ] 112/300 VUs  1m37.6s/4m00.0s

running (1m42.0s), 114/300 VUs, 18579 complete and 0 interrupted iterations
ramp_up   [  41% ] 114/300 VUs  1m38.6s/4m00.0s

running (1m43.0s), 116/300 VUs, 18796 complete and 0 interrupted iterations
ramp_up   [  42% ] 116/300 VUs  1m39.6s/4m00.0s

running (1m44.0s), 117/300 VUs, 19117 complete and 0 interrupted iterations
ramp_up   [  42% ] 117/300 VUs  1m40.6s/4m00.0s

running (1m45.0s), 119/300 VUs, 19399 complete and 0 interrupted iterations
ramp_up   [  42% ] 119/300 VUs  1m41.6s/4m00.0s

running (1m46.0s), 121/300 VUs, 19714 complete and 0 interrupted iterations
ramp_up   [  43% ] 121/300 VUs  1m42.6s/4m00.0s

running (1m47.0s), 122/300 VUs, 19866 complete and 0 interrupted iterations
ramp_up   [  43% ] 122/300 VUs  1m43.6s/4m00.0s

running (1m48.0s), 124/300 VUs, 20012 complete and 0 interrupted iterations
ramp_up   [  44% ] 124/300 VUs  1m44.6s/4m00.0s

running (1m49.0s), 126/300 VUs, 20306 complete and 0 interrupted iterations
ramp_up   [  44% ] 126/300 VUs  1m45.6s/4m00.0s

running (1m50.0s), 127/300 VUs, 20532 complete and 0 interrupted iterations
ramp_up   [  44% ] 127/300 VUs  1m46.6s/4m00.0s

running (1m51.0s), 129/300 VUs, 20737 complete and 0 interrupted iterations
ramp_up   [  45% ] 129/300 VUs  1m47.6s/4m00.0s

running (1m52.0s), 131/300 VUs, 20982 complete and 0 interrupted iterations
ramp_up   [  45% ] 131/300 VUs  1m48.6s/4m00.0s

running (1m53.0s), 132/300 VUs, 21155 complete and 0 interrupted iterations
ramp_up   [  46% ] 132/300 VUs  1m49.6s/4m00.0s

running (1m54.0s), 134/300 VUs, 21460 complete and 0 interrupted iterations
ramp_up   [  46% ] 134/300 VUs  1m50.6s/4m00.0s

running (1m55.0s), 136/300 VUs, 21730 complete and 0 interrupted iterations
ramp_up   [  47% ] 136/300 VUs  1m51.6s/4m00.0s

running (1m56.0s), 137/300 VUs, 21924 complete and 0 interrupted iterations
ramp_up   [  47% ] 137/300 VUs  1m52.6s/4m00.0s

running (1m57.0s), 139/300 VUs, 22114 complete and 0 interrupted iterations
ramp_up   [  47% ] 139/300 VUs  1m53.6s/4m00.0s

running (1m58.0s), 141/300 VUs, 22245 complete and 0 interrupted iterations
ramp_up   [  48% ] 141/300 VUs  1m54.6s/4m00.0s

running (1m59.0s), 142/300 VUs, 22472 complete and 0 interrupted iterations
ramp_up   [  48% ] 142/300 VUs  1m55.6s/4m00.0s

running (2m00.0s), 144/300 VUs, 22707 complete and 0 interrupted iterations
ramp_up   [  49% ] 144/300 VUs  1m56.6s/4m00.0s

running (2m01.0s), 146/300 VUs, 22919 complete and 0 interrupted iterations
ramp_up   [  49% ] 146/300 VUs  1m57.6s/4m00.0s

running (2m02.0s), 147/300 VUs, 23138 complete and 0 interrupted iterations
ramp_up   [  49% ] 147/300 VUs  1m58.6s/4m00.0s

running (2m03.0s), 149/300 VUs, 23321 complete and 0 interrupted iterations
ramp_up   [  50% ] 149/300 VUs  1m59.6s/4m00.0s

running (2m04.0s), 151/300 VUs, 23561 complete and 0 interrupted iterations
ramp_up   [  50% ] 151/300 VUs  2m00.6s/4m00.0s

running (2m05.0s), 152/300 VUs, 23835 complete and 0 interrupted iterations
ramp_up   [  51% ] 152/300 VUs  2m01.6s/4m00.0s

running (2m06.0s), 154/300 VUs, 24023 complete and 0 interrupted iterations
ramp_up   [  51% ] 154/300 VUs  2m02.6s/4m00.0s

running (2m07.0s), 156/300 VUs, 24177 complete and 0 interrupted iterations
ramp_up   [  52% ] 156/300 VUs  2m03.6s/4m00.0s

running (2m08.0s), 157/300 VUs, 24377 complete and 0 interrupted iterations
ramp_up   [  52% ] 157/300 VUs  2m04.6s/4m00.0s

running (2m09.0s), 159/300 VUs, 24626 complete and 0 interrupted iterations
ramp_up   [  52% ] 159/300 VUs  2m05.6s/4m00.0s

running (2m10.0s), 161/300 VUs, 24897 complete and 0 interrupted iterations
ramp_up   [  53% ] 161/300 VUs  2m06.6s/4m00.0s

running (2m11.0s), 162/300 VUs, 25140 complete and 0 interrupted iterations
ramp_up   [  53% ] 162/300 VUs  2m07.6s/4m00.0s

running (2m12.0s), 164/300 VUs, 25389 complete and 0 interrupted iterations
ramp_up   [  54% ] 164/300 VUs  2m08.6s/4m00.0s

running (2m13.0s), 166/300 VUs, 25590 complete and 0 interrupted iterations
ramp_up   [  54% ] 166/300 VUs  2m09.6s/4m00.0s

running (2m14.0s), 167/300 VUs, 25765 complete and 0 interrupted iterations
ramp_up   [  54% ] 167/300 VUs  2m10.6s/4m00.0s

running (2m15.0s), 169/300 VUs, 25973 complete and 0 interrupted iterations
ramp_up   [  55% ] 169/300 VUs  2m11.6s/4m00.0s

running (2m16.0s), 171/300 VUs, 26175 complete and 0 interrupted iterations
ramp_up   [  55% ] 171/300 VUs  2m12.6s/4m00.0s

running (2m17.0s), 172/300 VUs, 26418 complete and 0 interrupted iterations
ramp_up   [  56% ] 172/300 VUs  2m13.6s/4m00.0s

running (2m18.0s), 174/300 VUs, 26634 complete and 0 interrupted iterations
ramp_up   [  56% ] 174/300 VUs  2m14.6s/4m00.0s

running (2m19.0s), 176/300 VUs, 26924 complete and 0 interrupted iterations
ramp_up   [  57% ] 176/300 VUs  2m15.6s/4m00.0s

running (2m20.0s), 177/300 VUs, 27165 complete and 0 interrupted iterations
ramp_up   [  57% ] 177/300 VUs  2m16.6s/4m00.0s

running (2m21.0s), 179/300 VUs, 27423 complete and 0 interrupted iterations
ramp_up   [  57% ] 179/300 VUs  2m17.6s/4m00.0s

running (2m22.0s), 181/300 VUs, 27696 complete and 0 interrupted iterations
ramp_up   [  58% ] 181/300 VUs  2m18.6s/4m00.0s

running (2m23.0s), 182/300 VUs, 27992 complete and 0 interrupted iterations
ramp_up   [  58% ] 182/300 VUs  2m19.6s/4m00.0s

running (2m24.0s), 184/300 VUs, 28220 complete and 0 interrupted iterations
ramp_up   [  59% ] 184/300 VUs  2m20.6s/4m00.0s

running (2m25.0s), 186/300 VUs, 28520 complete and 0 interrupted iterations
ramp_up   [  59% ] 186/300 VUs  2m21.6s/4m00.0s

running (2m26.0s), 187/300 VUs, 28790 complete and 0 interrupted iterations
ramp_up   [  59% ] 187/300 VUs  2m22.6s/4m00.0s

running (2m27.0s), 189/300 VUs, 29054 complete and 0 interrupted iterations
ramp_up   [  60% ] 189/300 VUs  2m23.6s/4m00.0s

running (2m28.0s), 191/300 VUs, 29200 complete and 0 interrupted iterations
ramp_up   [  60% ] 191/300 VUs  2m24.6s/4m00.0s

running (2m29.0s), 192/300 VUs, 29448 complete and 0 interrupted iterations
ramp_up   [  61% ] 192/300 VUs  2m25.6s/4m00.0s

running (2m30.0s), 194/300 VUs, 29712 complete and 0 interrupted iterations
ramp_up   [  61% ] 194/300 VUs  2m26.6s/4m00.0s

running (2m31.0s), 196/300 VUs, 29871 complete and 0 interrupted iterations
ramp_up   [  62% ] 196/300 VUs  2m27.6s/4m00.0s

running (2m32.0s), 197/300 VUs, 30120 complete and 0 interrupted iterations
ramp_up   [  62% ] 197/300 VUs  2m28.6s/4m00.0s

running (2m33.0s), 199/300 VUs, 30363 complete and 0 interrupted iterations
ramp_up   [  62% ] 199/300 VUs  2m29.6s/4m00.0s

running (2m34.0s), 201/300 VUs, 30610 complete and 0 interrupted iterations
ramp_up   [  63% ] 201/300 VUs  2m30.6s/4m00.0s

running (2m35.0s), 202/300 VUs, 30822 complete and 0 interrupted iterations
ramp_up   [  63% ] 202/300 VUs  2m31.6s/4m00.0s

running (2m36.0s), 204/300 VUs, 31071 complete and 0 interrupted iterations
ramp_up   [  64% ] 204/300 VUs  2m32.6s/4m00.0s

running (2m37.0s), 206/300 VUs, 31282 complete and 0 interrupted iterations
ramp_up   [  64% ] 206/300 VUs  2m33.6s/4m00.0s

running (2m38.0s), 207/300 VUs, 31449 complete and 0 interrupted iterations
ramp_up   [  64% ] 207/300 VUs  2m34.6s/4m00.0s

running (2m39.0s), 209/300 VUs, 31647 complete and 0 interrupted iterations
ramp_up   [  65% ] 209/300 VUs  2m35.6s/4m00.0s

running (2m40.0s), 211/300 VUs, 31900 complete and 0 interrupted iterations
ramp_up   [  65% ] 211/300 VUs  2m36.6s/4m00.0s

running (2m41.0s), 212/300 VUs, 32123 complete and 0 interrupted iterations
ramp_up   [  66% ] 212/300 VUs  2m37.6s/4m00.0s

running (2m42.0s), 214/300 VUs, 32386 complete and 0 interrupted iterations
ramp_up   [  66% ] 214/300 VUs  2m38.6s/4m00.0s

running (2m43.0s), 216/300 VUs, 32660 complete and 0 interrupted iterations
ramp_up   [  67% ] 216/300 VUs  2m39.6s/4m00.0s

running (2m44.0s), 217/300 VUs, 32858 complete and 0 interrupted iterations
ramp_up   [  67% ] 217/300 VUs  2m40.6s/4m00.0s

running (2m45.0s), 219/300 VUs, 33116 complete and 0 interrupted iterations
ramp_up   [  67% ] 219/300 VUs  2m41.6s/4m00.0s

running (2m46.0s), 221/300 VUs, 33385 complete and 0 interrupted iterations
ramp_up   [  68% ] 221/300 VUs  2m42.6s/4m00.0s

running (2m47.0s), 222/300 VUs, 33528 complete and 0 interrupted iterations
ramp_up   [  68% ] 222/300 VUs  2m43.6s/4m00.0s

running (2m48.0s), 224/300 VUs, 33702 complete and 0 interrupted iterations
ramp_up   [  69% ] 224/300 VUs  2m44.6s/4m00.0s

running (2m49.0s), 226/300 VUs, 33955 complete and 0 interrupted iterations
ramp_up   [  69% ] 226/300 VUs  2m45.6s/4m00.0s

running (2m50.0s), 227/300 VUs, 34267 complete and 0 interrupted iterations
ramp_up   [  69% ] 227/300 VUs  2m46.6s/4m00.0s

running (2m51.0s), 229/300 VUs, 34504 complete and 0 interrupted iterations
ramp_up   [  70% ] 229/300 VUs  2m47.6s/4m00.0s

running (2m52.0s), 231/300 VUs, 34782 complete and 0 interrupted iterations
ramp_up   [  70% ] 231/300 VUs  2m48.6s/4m00.0s

running (2m53.0s), 232/300 VUs, 35105 complete and 0 interrupted iterations
ramp_up   [  71% ] 232/300 VUs  2m49.6s/4m00.0s

running (2m54.0s), 234/300 VUs, 35364 complete and 0 interrupted iterations
ramp_up   [  71% ] 234/300 VUs  2m50.6s/4m00.0s

running (2m55.0s), 236/300 VUs, 35650 complete and 0 interrupted iterations
ramp_up   [  72% ] 236/300 VUs  2m51.6s/4m00.0s

running (2m56.0s), 237/300 VUs, 35935 complete and 0 interrupted iterations
ramp_up   [  72% ] 237/300 VUs  2m52.6s/4m00.0s

running (2m57.0s), 239/300 VUs, 36193 complete and 0 interrupted iterations
ramp_up   [  72% ] 239/300 VUs  2m53.6s/4m00.0s

running (2m58.0s), 241/300 VUs, 36299 complete and 0 interrupted iterations
ramp_up   [  73% ] 241/300 VUs  2m54.6s/4m00.0s

running (2m59.0s), 242/300 VUs, 36582 complete and 0 interrupted iterations
ramp_up   [  73% ] 242/300 VUs  2m55.6s/4m00.0s

running (3m00.0s), 244/300 VUs, 36845 complete and 0 interrupted iterations
ramp_up   [  74% ] 244/300 VUs  2m56.6s/4m00.0s

running (3m01.0s), 246/300 VUs, 37052 complete and 0 interrupted iterations
ramp_up   [  74% ] 246/300 VUs  2m57.6s/4m00.0s

running (3m02.0s), 247/300 VUs, 37317 complete and 0 interrupted iterations
ramp_up   [  74% ] 247/300 VUs  2m58.6s/4m00.0s

running (3m03.0s), 249/300 VUs, 37557 complete and 0 interrupted iterations
ramp_up   [  75% ] 249/300 VUs  2m59.6s/4m00.0s

running (3m04.0s), 251/300 VUs, 37823 complete and 0 interrupted iterations
ramp_up   [  75% ] 251/300 VUs  3m00.6s/4m00.0s

running (3m05.0s), 252/300 VUs, 38078 complete and 0 interrupted iterations
ramp_up   [  76% ] 252/300 VUs  3m01.6s/4m00.0s

running (3m06.0s), 254/300 VUs, 38369 complete and 0 interrupted iterations
ramp_up   [  76% ] 254/300 VUs  3m02.6s/4m00.0s

running (3m07.0s), 256/300 VUs, 38677 complete and 0 interrupted iterations
ramp_up   [  77% ] 256/300 VUs  3m03.6s/4m00.0s

running (3m08.0s), 257/300 VUs, 38856 complete and 0 interrupted iterations
ramp_up   [  77% ] 257/300 VUs  3m04.6s/4m00.0s

running (3m09.0s), 259/300 VUs, 39039 complete and 0 interrupted iterations
ramp_up   [  77% ] 259/300 VUs  3m05.6s/4m00.0s

running (3m10.0s), 261/300 VUs, 39262 complete and 0 interrupted iterations
ramp_up   [  78% ] 261/300 VUs  3m06.6s/4m00.0s

running (3m11.0s), 262/300 VUs, 39520 complete and 0 interrupted iterations
ramp_up   [  78% ] 262/300 VUs  3m07.6s/4m00.0s

running (3m12.0s), 264/300 VUs, 39795 complete and 0 interrupted iterations
ramp_up   [  79% ] 264/300 VUs  3m08.6s/4m00.0s

running (3m13.0s), 266/300 VUs, 40084 complete and 0 interrupted iterations
ramp_up   [  79% ] 266/300 VUs  3m09.6s/4m00.0s

running (3m14.0s), 267/300 VUs, 40418 complete and 0 interrupted iterations
ramp_up   [  79% ] 267/300 VUs  3m10.6s/4m00.0s

running (3m15.0s), 269/300 VUs, 40627 complete and 0 interrupted iterations
ramp_up   [  80% ] 269/300 VUs  3m11.6s/4m00.0s

running (3m16.0s), 271/300 VUs, 40750 complete and 0 interrupted iterations
ramp_up   [  80% ] 271/300 VUs  3m12.6s/4m00.0s

running (3m17.0s), 272/300 VUs, 41019 complete and 0 interrupted iterations
ramp_up   [  81% ] 272/300 VUs  3m13.6s/4m00.0s

running (3m18.0s), 274/300 VUs, 41188 complete and 0 interrupted iterations
ramp_up   [  81% ] 274/300 VUs  3m14.6s/4m00.0s

running (3m19.0s), 276/300 VUs, 41395 complete and 0 interrupted iterations
ramp_up   [  82% ] 276/300 VUs  3m15.6s/4m00.0s

running (3m20.0s), 277/300 VUs, 41590 complete and 0 interrupted iterations
ramp_up   [  82% ] 277/300 VUs  3m16.6s/4m00.0s

running (3m21.0s), 279/300 VUs, 41854 complete and 0 interrupted iterations
ramp_up   [  82% ] 279/300 VUs  3m17.6s/4m00.0s

running (3m22.0s), 281/300 VUs, 42119 complete and 0 interrupted iterations
ramp_up   [  83% ] 281/300 VUs  3m18.6s/4m00.0s

running (3m23.0s), 282/300 VUs, 42439 complete and 0 interrupted iterations
ramp_up   [  83% ] 282/300 VUs  3m19.6s/4m00.0s

running (3m24.0s), 284/300 VUs, 42653 complete and 0 interrupted iterations
ramp_up   [  84% ] 284/300 VUs  3m20.6s/4m00.0s

running (3m25.0s), 286/300 VUs, 42948 complete and 0 interrupted iterations
ramp_up   [  84% ] 286/300 VUs  3m21.6s/4m00.0s

running (3m26.0s), 287/300 VUs, 43070 complete and 0 interrupted iterations
ramp_up   [  84% ] 287/300 VUs  3m22.6s/4m00.0s

running (3m27.0s), 289/300 VUs, 43150 complete and 0 interrupted iterations
ramp_up   [  85% ] 289/300 VUs  3m23.6s/4m00.0s

running (3m28.0s), 291/300 VUs, 43202 complete and 0 interrupted iterations
ramp_up   [  85% ] 291/300 VUs  3m24.6s/4m00.0s

running (3m29.0s), 292/300 VUs, 43344 complete and 0 interrupted iterations
ramp_up   [  86% ] 292/300 VUs  3m25.6s/4m00.0s

running (3m30.0s), 294/300 VUs, 43485 complete and 0 interrupted iterations
ramp_up   [  86% ] 294/300 VUs  3m26.6s/4m00.0s

running (3m31.0s), 296/300 VUs, 43554 complete and 0 interrupted iterations
ramp_up   [  87% ] 296/300 VUs  3m27.6s/4m00.0s

running (3m32.0s), 297/300 VUs, 43630 complete and 0 interrupted iterations
ramp_up   [  87% ] 297/300 VUs  3m28.6s/4m00.0s

running (3m33.0s), 299/300 VUs, 43758 complete and 0 interrupted iterations
ramp_up   [  87% ] 299/300 VUs  3m29.6s/4m00.0s

running (3m34.0s), 300/300 VUs, 43919 complete and 0 interrupted iterations
ramp_up   [  88% ] 300/300 VUs  3m30.6s/4m00.0s

running (3m35.0s), 294/300 VUs, 44097 complete and 0 interrupted iterations
ramp_up   [  88% ] 294/300 VUs  3m31.6s/4m00.0s

running (3m36.0s), 283/300 VUs, 44277 complete and 0 interrupted iterations
ramp_up   [  89% ] 283/300 VUs  3m32.6s/4m00.0s

running (3m37.0s), 277/300 VUs, 44451 complete and 0 interrupted iterations
ramp_up   [  89% ] 277/300 VUs  3m33.6s/4m00.0s

running (3m38.0s), 271/300 VUs, 44548 complete and 0 interrupted iterations
ramp_up   [  89% ] 271/300 VUs  3m34.6s/4m00.0s

running (3m39.0s), 259/300 VUs, 44664 complete and 0 interrupted iterations
ramp_up   [  90% ] 259/300 VUs  3m35.6s/4m00.0s

running (3m40.0s), 248/300 VUs, 44795 complete and 0 interrupted iterations
ramp_up   [  90% ] 248/300 VUs  3m36.6s/4m00.0s

running (3m41.0s), 234/300 VUs, 44898 complete and 0 interrupted iterations
ramp_up   [  91% ] 234/300 VUs  3m37.6s/4m00.0s

running (3m42.0s), 225/300 VUs, 45081 complete and 0 interrupted iterations
ramp_up   [  91% ] 225/300 VUs  3m38.6s/4m00.0s

running (3m43.0s), 211/300 VUs, 45256 complete and 0 interrupted iterations
ramp_up   [  92% ] 211/300 VUs  3m39.6s/4m00.0s

running (3m44.0s), 201/300 VUs, 45460 complete and 0 interrupted iterations
ramp_up   [  92% ] 201/300 VUs  3m40.6s/4m00.0s

running (3m45.0s), 191/300 VUs, 45642 complete and 0 interrupted iterations
ramp_up   [  92% ] 191/300 VUs  3m41.6s/4m00.0s

running (3m46.0s), 181/300 VUs, 45769 complete and 0 interrupted iterations
ramp_up   [  93% ] 181/300 VUs  3m42.6s/4m00.0s

running (3m47.0s), 169/300 VUs, 45963 complete and 0 interrupted iterations
ramp_up   [  93% ] 169/300 VUs  3m43.6s/4m00.0s

running (3m48.0s), 161/300 VUs, 46074 complete and 0 interrupted iterations
ramp_up   [  94% ] 161/300 VUs  3m44.6s/4m00.0s

running (3m49.0s), 146/300 VUs, 46234 complete and 0 interrupted iterations
ramp_up   [  94% ] 146/300 VUs  3m45.6s/4m00.0s

running (3m50.0s), 136/300 VUs, 46416 complete and 0 interrupted iterations
ramp_up   [  94% ] 136/300 VUs  3m46.6s/4m00.0s

running (3m51.0s), 130/300 VUs, 46619 complete and 0 interrupted iterations
ramp_up   [  95% ] 130/300 VUs  3m47.6s/4m00.0s

running (3m52.0s), 120/300 VUs, 46811 complete and 0 interrupted iterations
ramp_up   [  95% ] 120/300 VUs  3m48.6s/4m00.0s

running (3m53.0s), 110/300 VUs, 46926 complete and 0 interrupted iterations
ramp_up   [  96% ] 110/300 VUs  3m49.6s/4m00.0s

running (3m54.0s), 098/300 VUs, 47091 complete and 0 interrupted iterations
ramp_up   [  96% ] 098/300 VUs  3m50.6s/4m00.0s

running (3m55.0s), 086/300 VUs, 47288 complete and 0 interrupted iterations
ramp_up   [  97% ] 086/300 VUs  3m51.6s/4m00.0s

running (3m56.0s), 076/300 VUs, 47473 complete and 0 interrupted iterations
ramp_up   [  97% ] 076/300 VUs  3m52.6s/4m00.0s

running (3m57.0s), 067/300 VUs, 47660 complete and 0 interrupted iterations
ramp_up   [  97% ] 067/300 VUs  3m53.6s/4m00.0s

running (3m58.0s), 056/300 VUs, 47782 complete and 0 interrupted iterations
ramp_up   [  98% ] 056/300 VUs  3m54.6s/4m00.0s

running (3m59.0s), 046/300 VUs, 47948 complete and 0 interrupted iterations
ramp_up   [  98% ] 046/300 VUs  3m55.6s/4m00.0s

running (4m00.0s), 035/300 VUs, 48143 complete and 0 interrupted iterations
ramp_up   [  99% ] 035/300 VUs  3m56.6s/4m00.0s

running (4m01.0s), 025/300 VUs, 48264 complete and 0 interrupted iterations
ramp_up   [  99% ] 025/300 VUs  3m57.6s/4m00.0s

running (4m02.0s), 014/300 VUs, 48391 complete and 0 interrupted iterations
ramp_up   [  99% ] 014/300 VUs  3m58.6s/4m00.0s

running (4m03.0s), 005/300 VUs, 48473 complete and 0 interrupted iterations
ramp_up   [ 100% ] 005/300 VUs  3m59.6s/4m00.0s
time="2026-03-27T03:24:31+09:00" level=info msg="=== 테스트 완료 (replicas=1) ===" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="k6 summary에서 아래 지표를 비교하세요:" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="  payment_duration p50/p95/p99 — 응답시간" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="  total_requests             — 총 처리량" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="  payment_success_rate       — 성공률" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="  point_inconsistency        — 데이터 정합성" source=console
time="2026-03-27T03:24:31+09:00" level=info msg="================================================" source=console


  █ THRESHOLDS 

    overdraft_detected
    ✓ 'count<1' count=0

    payment_duration
    ✓ 'p(95)<5000' p(95)=781ms

    payment_success_rate
    ✓ 'rate>0.90' rate=90.15%

    point_inconsistency
    ✓ 'count<1' count=0

    rollback_missing
    ✓ 'count<1' count=0


  █ TOTAL RESULTS 

    CUSTOM
    overdraft_detected.............: 0      0/s
    payment_duration...............: avg=264.42ms min=6ms     med=180ms    max=4.17s p(90)=565ms    p(95)=781ms   
    payment_failures...............: 4776   19.624816/s
    payment_success_rate...........: 90.15% 43712 out of 48488
    point_inconsistency............: 0      0/s
    rollback_missing...............: 0      0/s
    total_requests.................: 48488  199.239546/s

    HTTP
    http_req_duration..............: avg=215.08ms min=1.48ms  med=132.75ms max=5.7s  p(90)=498.83ms p(95)=699.71ms
      { expected_response:true }...: avg=207.23ms min=1.48ms  med=127.8ms  max=5.7s  p(90)=481.12ms p(95)=673.08ms
    http_req_failed................: 3.27%  4776 out of 145964
    http_reqs......................: 145964 599.773162/s

    EXECUTION
    iteration_duration.............: avg=698.05ms min=60.32ms med=532.6ms  max=7.2s  p(90)=1.37s    p(95)=1.78s   
    iterations.....................: 48488  199.239546/s
    vus............................: 5      min=0              max=300
    vus_max........................: 300    min=300            max=300

    NETWORK
    data_received..................: 49 MB  199 kB/s
    data_sent......................: 28 MB  114 kB/s



running (4m03.4s), 000/300 VUs, 48488 complete and 0 interrupted iterations
ramp_up ✓ [ 100% ] 000/300 VUs  4m0s